water_air/angle45/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)         //0
    (13.5 0 0)      //1
    (13.5 1 0)      //2
    (0 1 0)         //3
    (0 0 0.5)       //4
    (13.5 0 0.5)    //5
    (13.5 1 0.5)    //6
    (0 1 0.5)       //7

    (3.5 1 0)     //8
    (4.2071 0.2928 0)//9
    (4.3071 0.3928 0)//10
    (3.6 1 0)//11

    (3.5 1 0.5)     //12
    (4.2071 0.2928 0.5)//13
    (4.3071 0.3928 0.5)//14
    (3.6 1 0.5)//15
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (90 90 90)
    simpleGrading (1 1 1)

   hex (8 9 10 11 12 13 14 15) 
   (90 90 90) 
   simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    down
    {
        type symmetryPlane;
        faces
        (
            (0 4 5 1)
        );
    }

    up
    {
        type wall;
        faces
        (
            (3 7 6 2)
            
            (8 12 13 9)
            (9 13 14 10)
            (11 15 14 10)
        );
    }

    walls
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
